{
    "name": "Nihir Zala",
    "logo_name": "Nihir-Zala",
    "role": "Full-Stack Laravel Developer",
    "about": {
        "sections": {
            "professional-info": {
                "title": "professional-info",
                "icon": "icons/info-professional.svg",
                "info": {
                    "experience": {
                        "title": "experience",
                        "description": "<br>I have over four years of professional experience as a Laravel Developer, currently working at TechAbbot. My role has allowed me to work on large-scale projects, focusing on backend development, RESTful API integration, and database optimization. I have contributed to building secure, scalable, and maintainable applications while collaborating closely with cross-functional teams to deliver high-quality solutions."
                    },
                    "hard-skills": {
                        "title": "hard-skills",
                        "description": "<br>My core technical expertise includes Laravel, PHP, MySQL, JavaScript, and Bootstrap, with a specialization in developing efficient backend systems and APIs. I also have hands-on experience with modern frontend frameworks like Nuxt.js and React, which allows me to work on full-stack solutions and deliver seamless user experiences. I am skilled in database design, query optimization, and implementing secure authentication mechanisms, as well as version control with Git and package/library development. Currently, I am expanding my knowledge by learning Rust, with the goal of building high-performance and memory-safe applications in the future."
                    },
                    "soft-skills": {
                        "title": "soft-skills",
                        "description": "<br>Beyond my technical expertise, I bring strong problem-solving abilities, adaptability, and a commitment to continuous learning. I value teamwork and effective communication, which helps me collaborate productively with both developers and non-technical stakeholders. I am highly motivated, detail-oriented, and able to manage tasks independently while maintaining a focus on delivering impactful results."
                    }
                }
            },
            "personal-info": {
                "title": "personal-info",
                "icon": "icons/info-personal.svg",
                "info": { 
                    "bio": {
                        "title": "bio",
                        "description": "<br> About me <br> I am Nihir Zala, a passionate and self-driven individual with a strong interest in technology and creative problem-solving. I enjoy exploring how things work, learning new programming languages and frameworks, and constantly pushing myself to grow both personally and professionally. My approach is guided by curiosity, discipline, and a commitment to continuous improvement."
                    },
                    "interests": {
                        "title": "interests",
                        "description": "<br>Beyond development, I have a wide range of interests that keep me motivated and balanced. I enjoy participating in coding challenges, CTF competitions, and open-source contributions. In my free time, I like sports, gaming, music, and exploring new technologies like Rust, Nuxt, and React. These activities help me sharpen my skills, stay creative, and maintain a healthy work-life balance."
                    },
                    "education": {
                        "title": "education",
                        "description": "<br>I completed my high school education with a strong foundation in science and mathematics, which sparked my interest in technology early on. I then pursued my university studies, where I specialized in Computer Application, gaining both theoretical knowledge and practical experience that prepared me for a career in software development.",
                        "files": {
                            "university": "Saurastra University"
                        }
                    }
                }
            },
            "hobbies-info": {
                "title": "hobbies-info",
                "icon": "icons/info-hobbies.svg",
                "info": {
                    "sports": {
                        "title": "sports",
                        "description": "<br>Sports keep me disciplined, competitive, and motivated. I regularly play cricket and football, which help me build teamwork skills and maintain a healthy lifestyle."
                    },
                    "favorite-games": {
                        "title": "favorite-games",
                        "description": "<br>Gaming has always been one of my favorite pastimes as it helps me relax while also sharpening my focus and strategic thinking. I particularly enjoy playing battle royale and tactical shooters like PUBG/BGMI and Valorant, which test my teamwork and decision-making under pressure. I also like classic competitive games such as CS:GO for improving quick reflexes, and FIFA because football is just as exciting on the screen as it is on the field."
                    }
                }
            }
        }
    },
    "contacts": {
        "direct": {
            "title": "contacts",
            "sources": {
                "email": "testnihir@gmail.com",
                "phone": "+919714742706"
            }
        },
        "social": {
            "github": {
                "title": "Github profile",
                "url": "https://github.com/",
                "user": "ZalaNihir"
            },
            "medium": {
                "title": "Medium profile",
                "url": "https://nihirzala.medium.com/",
                "user": "ZalaNihir"
            },
            "linkedin": {
                "title": "linkedin profile",
                "url": "https://www.linkedin.com/in/",
                "user": "nihirzala"
            }
        },
        "find_me_also_in": {
            "title": "find-me-also-in",
            "sources": {
                "youtube": {
                    "title": "YouTube channel",
                    "url": "https://www.youtube.com/",
                    "user": "username"
                },
                "gurushots": {
                    "title": "GuruShots profile",
                    "url": "https://gurushots.com/",
                    "user": "username"
                },
                "instagram": {
                    "title": "Instagram account",
                    "url": "https://instagram.com/",
                    "user": "username"
                },
                "twitch": {
                    "title": "Twitch profile",
                    "url": "https://twitch.com/",
                    "user": "username"
                }
            }
        }
    },
    "gists": {
        "1": "a495d16b3b4f06394bb8db331d7d0ffa"
    },
    "projects": {
        "1": {
            "title": "_ui-animations",
            "description": "Duis aute irure dolor in velit esse cillum dolore.",
            "img": "/images/projects/ui-animations2.png",
            "tech": ["Flutter"],
            "url": "https://github.com/"
        },
        "2": {
            "title": "_ai-resources",
            "description": "Duis aute irure dolor in velit esse cillum dolore.",
            "img": "/images/projects/ai-resources.png",
            "tech": ["Gatsby"],
            "url": "https://github.com/"
        },
        "3": {
            "title": "_worldmap",
            "description": "Duis aute irure dolor in velit esse cillum dolore.",
            "img": "/images/projects/worldmap.png",
            "tech": ["Angular"],
            "url": "https://github.com/"
        },
        "4": {
            "title": "_ui-animations",
            "description": "Duis aute irure dolor in velit esse cillum dolore.",
            "img": "/images/projects/ui-animations.png",
            "tech": ["React"],
            "url": "https://github.com/"
        },
        "5": {
            "title": "_tetris-game",
            "description": "Duis aute irure dolor in velit esse cillum dolore.",
            "img": "/images/projects/tetris-game.png",
            "tech": ["React"],
            "url": "https://github.com/"
        },
        "6": {
            "title": "_ethereum",
            "description": "Duis aute irure dolor in velit esse cillum dolore.",
            "img": "/images/projects/ethereum.png",
            "tech": ["Vue"],
            "url": "https://github.com/"
        }
    }
}